Repository: akmalbukhariev/EcoPlatesMobile
Catalog: EcoPlatesMobile/Resources/Languages/AppResource.*.resx
Languages: uz

source: Buyer
uz: Xaridor

# EnterPhoneCorrectly
source: You can use the platform efficiently through this phone number. It is very important that you enter your phone number correctly.
uz: Ushbu telefon raqam orqali siz platformadan unumli foydalanishingiz mumkin. Telefon raqamingizni to'g'ri kiritishingiz juda ham muhim.

# EnterPhoneNumber
source: Please enter your phone number
uz: Iltimos, telefon raqamingizni kiriting

# SelectRole
source: Select your role as a user
uz: Foydalanuvchi sifatida o’zingizni rolingizni tanlang

source: Seller
uz: Sotuvchi

# AboutApp
source: About the Application
uz: Dastur haqida

# ForClient
source: For Clients
uz: Mijozlar uchun

# RoleSubtitleClient
source: Discover discounted food items nearby
uz: Yaqiningizdagi chegirmadagi oziq-ovqat mahsulotlarini kashf eting

# AboutAppPoint1Client
source: Browse a variety of discounted food offers.
uz: Chegirmadagi turli xil oziq-ovqat takliflarini ko‘zdan kechiring.

# AboutAppPoint2Client
source: View available items on a map.
uz: Mavjud mahsulotlarni xaritada ko‘rish.

# AboutAppPoint3Client
source: Adjust the radius to find offers within your location.
uz: Joylashuvingiz bo‘yicha takliflarni topish uchun radiusni sozlang.

# AboutAppPoint4Client
source: Receive notifications about new deals near you.
uz: Yaqiningizdagi yangi chegirmalar haqida bildirishnomalar oling.

# FinalMessageClient
source: Save money, reduce waste, and support your local community.
uz: Pul tejang, chiqindilarni kamaytiring va mahalliy hamjamiyatingizni qo‘llab-quvvatlang.

# ForSeller
source: For Sellers
uz: Sotuvchilar uchun

# RoleSubtitleSeller
source: Turn near-expiry stock into sales instead of waste
uz: Yaroqlilik muddati yaqinlashgan mahsulotlarni chiqindiga emas, savdoga aylantiring

# AboutAppPoint1Seller
source: Upload edible products before their expiration date.
uz: Yaroqlilik muddati tugashidan oldin iste’mol qilinadigan mahsulotlarni yuklang.

# AboutAppPoint2Seller
source: Offer discounts to attract nearby customers.
uz: Yaqin atrofdagi mijozlarni jalb qilish uchun chegirmalar taklif qiling.

# AboutAppPoint3Seller
source: Get notified when your product is about to expire.
uz: Mahsulotingizning yaroqlilik muddati tugash arafasida bo‘lsa, xabarnoma oling.

# AboutAppPoint4Seller
source: Reach new buyers who are actively looking for affordable items.
uz: Arzon mahsulotlarni faol izlayotgan yangi xaridorlarga yetib boring.

# FinalMessageSeller
source: Sell smarter, reduce waste, and promote a sustainable business image.
uz: Aqlli savdo qiling, chiqindilarni kamaytiring va barqaror biznes imidjini targ‘ib qiling.

source: Next
uz: Keyingi

source: Change Number
uz: Raqamni o‘zgartirish

# ChangeNumberTitle
source: You can change your SaleTop number here. All your saved data — listings, favorites, and messages — will be moved to the new number.
uz: SaleTop raqamingizni shu yerda o‘zgartirishingiz mumkin. Barcha saqlangan ma'lumotlaringiz — e'lonlar, tanlanganlar va xabarlar — yangi raqamga o‘tkaziladi.

source: New Number
uz: Yangi raqam

# NewNumberTitle
source: Your new number will receive a confirmation code via SMS.
uz: Yangi raqamingizga SMS orqali tasdiqlash kodi yuboriladi.

source: Continue.
uz: Davom etish

# MessagePhoneExist
source: The phone number is already exist!
uz: Telefon raqami mavjud!

# MessageLoginAgain
source: The app will reload to apply your new phone number.
uz: Ilova yangi telefon raqamingizni qo‘llash uchun qayta yuklanadi.

source: Authorization
uz: Avtorizatsiya

# AuthorizationTitle1
source: With this phone number, you can use the platform effectively. It is very important to enter your phone number correctly.
uz: Ushbu telefon raqam orqali siz platformadan samarali foydalanishingiz mumkin. Telefon raqamingizni to‘g‘ri kiritishingiz juda muhim.

# AuthorizationTitle2
source: By entering your phone number, you agree to the public offer.
uz: Telefon raqamingizni kiritish orqali siz ommaviy ofertaga rozilik bildirasiz.

# MessageEnterPhoneNumber
source: Please enter the phone number!
uz: Iltimos, telefon raqamingizni kiriting!

source: Phone Number
uz: Telefon raqami

source: Phone Number Not Registered
uz: Telefon raqami ro‘yxatdan o‘tmagan

source: Error
uz: Xatolik

# ErrorUnexpected
source: Unexpected error occurred.
uz: Kutilmagan xatolik yuz berdi.

# MessagePhoneNumberIsNotValid
source: Please enter a valid phone number.
uz: Iltimos, yaroqli telefon raqamini kiriting.

# SuggestionTitle1
source: Suggestions and Complaints
uz: Taklif va shikoyatlar

# SuggestionTitle2
source: We value your feedback and are here to help.
uz: Fikringiz biz uchun muhim va biz sizga yordam berishga tayyormiz.

source: Select feedback type
uz: Fikr-mulohaza turini tanlang

source: Write your message...
uz: Xabaringizni yozing...

source: Submit
uz: Yuborish

source: Message
uz: Xabar

source: Suggestions
uz: Takliflar

source: Complaints
uz: Shikoyatlar

source: Missing Info
uz: Ma’lumot yetishmayapti

# MessageMissingInfo
source: Please select a type and enter your message.
uz: Iltimos, turini tanlang va xabaringizni kiriting.

source: Thank you!
uz: Rahmat!

# MessageFeedback
source: Your feedback has been submitted.
uz: Fikringiz yuborildi.

source: Close
uz: Yopish

source: Please
uz: Iltimos

# ConfirmationCodeTime
source: Time allocated to confirm the code.
uz: Kodni tasdiqlash uchun ajratilgan vaqt.

source: Confirm
uz: Tasdiqlash

# ConfirmTitle
source: enter the verification code sent via SMS to your phone number.
uz: telefon raqamingizga SMS orqali yuborilgan tasdiqlash kodini kiriting.

source: Edit
uz: Tahrirlash

source: Inactive
uz: Nofaol qilish

# InactiveTitle
source: Inactive
uz: Nofaol

source: Active products
uz: Faol mahsulotlar

# MessageConfirm
source: Do you want to proceed?
uz: Davom etishni xohlaysizmi?

source: Yes
uz: Ha

source: No
uz: Yo‘q

source: Inactive products
uz: Nofaol mahsulotlar

source: Delete
uz: O‘chirish

source: Active
uz: Faollashtirish

# ActiveTitle
source: Active
uz: Faol

source: Delete product
uz: Mahsulotni o‘chirish

source: Success.
uz: Muvaffaqiyatli

source: New product.
uz: Yangi mahsulot

source: Product images
uz: Mahsulot rasmini tanlang

source: Product name
uz: Mahsulot nomi

source: Product quantity
uz: Mahsulot miqdori

# PreviousPrice
source: so'm (previous price)
uz: so'm (oldingi narx)

# CurrentPrice
source: so'm Current price)
uz: so'm (xozirgi narx)

# ProductDescription
source: Enter a description of the product (optional)
uz: Mahsulot tavsifini kiriting

source: Add
uz: Qo‘shish

# ChooseOption
source: Choose an option
uz: Variantni tanlang

# SelectGallery
source: Select from Gallery
uz: Galereyadan tanlash

# TakePhoto
source: Take a Photo
uz: Rasmga olish

source: Cancel
uz: Bekor qilish

# PleaseEnterProductName
source: Please enter a product name.
uz: Iltimos, mahsulot nomini kiriting.

# MessageOldAndNewPrice
source: Old price and new price cannot be the same.
uz: Eski narx va yangi narx bir xil bo‘lishi mumkin emas.

# MessageValidPrice
source: Please enter valid prices.
uz: Iltimos, to‘g‘ri narxlarni kiriting.

# MessageSelectImage
source: Please select an image before registering.
uz: Ro‘yxatdan o‘tkazishdan oldin rasmni tanlang.

source: Register product.
uz: Mahsulotni ro‘yxatdan o‘tkazish

source: Update product
uz: Mahsulotni yangilash

source: Update
uz: Yangilash

source: Set New Photo
uz: Yangi rasmni o‘rnatish

source: Company name
uz: Kompaniya nomi

# StartWorkingTime
source: Work start time
uz: Ish boshlanish vaqti

# EndWorkingTime
source: Work end time
uz: Ish tugash vaqti

source: Log Out
uz: Chiqish

source: Done
uz: Saqlash

source: Update profile
uz: Profilni yangilash

source: My Profile
uz: Profilim

source: Location
uz: Manzil

source: Share
uz: Ulashish

# FeedbackComplaints
source: Feedback and complaints
uz: Fikr va shikoyatlar

source: Role: Seller
uz: Rol: Sotuvchi

source: Company registration
uz: Kompaniyani ro‘yxatdan o‘tkazish

source: Company logo
uz: Kompaniya logotipi

source: Company type
uz: Kompaniya turi

source: Company address
uz: Kompaniya manzili

source: Registration
uz: Ro‘yxatdan o‘tish

source: Failed
uz: Muvaffaqiyatsiz

# MessageFieldCannotBeEmty
source: Field can not be emty
uz: Maydon bo‘sh bo‘lishi mumkin emas

# MessageSelectCompanyType
source: Please select the company type.
uz: Iltimos, kompaniya turini tanlang.

# MessageSelectCompanyLogo
source: Please select or take picture of the organization.
uz: Iltimos, tashkilot logotipini tanlang yoki suratga oling.

# MessageRegistrationSuccess
source: Registration has been completed successfully.
uz: Ro‘yxatdan o‘tish muvaffaqiyatli yakunlandi.

source: Setting current location
uz: Hozirgi joylashuvim

# MessageUpdateLocation
source: Update location
uz: Joylashuvni yangilash

source: Your workplace
uz: Ish joyingiz

source: Specify your work location
uz: Ish joyingizni ko‘rsating.

source: Current location
uz: Hozirgi joylashuv

# ActiveProductCount
source: Currently active products:
uz: Hozirda faol mahsulotlar:

# InActiveProductCount
source: Inactive products:
uz: Nofaol mahsulotlar:

source: Nearby — within
uz: Yaqin atrof —

source: around
uz: atrofida

source: Restaurant
uz: Restoran

source: Bakery
uz: Nonvoyxona

source: Fast Food
uz: Fastfud

source: Cafe
uz: Kafe

source: Recent searches
uz: So‘nggi qidiruvlar

# FailedGetLocation
source: Failed to get location:
uz: Joylashuvni aniqlab bo‘lmadi:

source: Could not get current location.
uz: Joriy joylashuvni aniqlab bo‘lmadi.

source: List
uz: Ro‘yxat

source: Map
uz: Xarita

source: Type
uz: Tur

source: Favorites
uz: Sevimlilar

source: Products
uz: Mahsulotlar

source: Role: Buyer
uz: Rol: Xaridor

source: Language Changed
uz: Til o‘zgartirildi

# MessageLanguageChanged
source: The app will reload to apply the selected language.
uz: Tanlangan tilni qo‘llash uchun ilova qayta yuklanadi.

# WhatOtherPeopleSaying
source: WHAT OTHER PEOPLE ARE SAYING
uz: BOSHQA ODAMLAR NIMA DEYMOQDA

source: What you need to know
uz: Bilishingiz kerak

source: Back
uz: Orqaga

# MoreInfoAboutStore
source: More information about the store
uz: Do‘kon haqida qo‘shimcha ma’lumot

# ChooseLocationAvailable
source: Select location to view products
uz: Mavjud mahsulotlarni ko‘rish uchun joylashuvni tanlang

source: Top
uz: Eng yuqori

source: Highlights
uz: asosiy jihatlar

source: Info
uz: Maʼlumot

# MessageInfo
source: Poster does not exist or has been deleted.
uz: Mahsulot mavjud emas yoki o‘chirib tashlangan.

# SelectDistance
source: Select a distance
uz: Masofani tanlang

source: 📍 Use my current location
uz: 📍 Hozirgi joylashuvimga o'tish

# ShowResult
source: Show results
uz: Natijani ko‘rish

source: You are here
uz: Siz shu yerdasiz

# LeaveReview
source: Leave a review
uz: Sharh qoldiring

# EvaluateProduct
source: Evaluate product quality
uz: Mahsulot sifatini baholang

# HowSatisfiedTitle
source: How satisfied are you with the quality of this product?
uz: Ushbu mahsulot sifati sizni qanchalik qoniqtirdi?

# PleaseRateTitle
source: Please rate this product in detail.
uz: Iltimos, mahsulotni batafsil baholang.

source: Great Value
uz: Ajoyib narx

source: Delicious Food
uz: Mazali taom

source: Great Service
uz: A’lo darajadagi xizmat

source: Review completed
uz: Jo'nating

source: Rating
uz: Reyting

# MakerLocation
source: Address
uz: Manzil

source: User name
uz: Foydalanuvchi ismi

source: Enter name
uz: Ismingizni kiriting

source: Register
uz: Ro‘yxatdan o‘tish

# PleaseEnterName
source: Please enter the name
uz: Iltimos, ismingizni kiriting

# RegistrationCompleted
source: Registration has been completed successfully.
uz: Ro‘yxatdan o‘tish muvaffaqiyatli yakunlandi.

source: Review
uz: Sharh

source: Please write it
uz: Iltimos, fikringizni bildiring

# HonestTitle
source: Honest opinions help other customers
uz: Samimiy fikrlar boshqa mijozlarga yordam beradi

# WriteProductReview
source: Write a product review >
uz: Mahsulotga sharh bildiring >

source: Discover
uz: Mahsulot

source: Browse
uz: Xarita

source: Favourites
uz: Yoqqanlar

source: Profile
uz: Profil

source: Location Permission Required
uz: Joylashuv ruxsati talab qilinadi

# MessageLocationPermission
source: Location access is required for this app. Please allow location permission.
uz: Iltimos, qurilmangiz sozlamalaridan joylashuvga ruxsat bering, chunki joylashuv ma'lumotlari ilova uchun muhimdir.

source: Open Settings
uz: Sozlamalarni ochish

# ConfirmCompanyLocation
source: Is this location really your workplace location?
uz: Bu joy haqiqatan ham sizning ish joyingizmi?

# MessageLocationEmpty
source: Location cannot be empty.
uz: Iltimos joylashuvni belgilang.
